{
    "home":"home",
    "about":"about",
    "skills":"skills",
    "portfolio":"portfolio",
    "contact":"contact",
    "home__title":"Hi, I'm Zhiye \"Caesar\" Zhao",
    "home__subtitle":"Robotics Engineer | AI Researcher",
    "home__description":"Engineer with hands-on experience in robotics and AI, dedicated to delivering innovative, high-quality solutions.",
    "home__contact":"Contact Me",
    "home__scroll-name":"Scroll down",
    "about__title":"About Me",
    "about__subtitle":"Brief Introduction",
    "about__description":"I have extensive experience in developing robotic systems, with expertise in path planning, multi-sensor fusion, state estimation, motion control, and vision processing. I’m capable of managing the full development cycle—from algorithm design to simulation and deployment. Currently, I focus on embodied intelligence, where I explore how reinforcement learning and perception-decision models can enhance the autonomy and adaptability of next-generation humanoid robots, promoting their real-world adoption in industrial and service scenarios.",
    "about__info-name1":"Years of <br /> experience",
    "about__info-name2":"Completed <br /> projects",
    "about__info-name3":"Companies <br /> worked",
    "download":"Download CV",
    "skills__title":"Skills",
    "skills__subtitle":"My technical level",
    "skills__years":"More than 2 years",
    "skills__title2":"Artificial Intelligence",
    "skills__years2":"More than1 years",

    "qualification__title":"Qualification",
    "qualification__subtitle":"My personal journey",
    "education":"Education",
    "work":"Work",
    "qualification1__title":"Mechanical Design Manufacture and Automation",
    "qualification1__subtitle":"Hunan Institute of Technology",
    "qualification2__title":"Master of Professional Engineering, Robotics ",
    "qualification2__subtitle":"University of Technology Sydney (UTS)",
    "qualification3__title":"Embodied Intelligence",
    "qualification3__subtitle":"Self-Study",

    "qualification4__title":"Teaching Assistant & Research Assistant (Part time)",
    "qualification4__subtitle":"Remote, Part-time",


    "qualification5__title":"Research & Development Engineer (Intern)",
    "qualification5__subtitle":"Optik Consultancy, Sydney",

    "portfolio__title":"Portfolio",
    "portfolio__subtitle":"Most recent works",

    "portfolio2__title":"Leader-Follower Formation Control with MPC",
    "portfolio2__description":"This project implements a leader-follower formation control system using Model Predictive Control (MPC) in MATLAB. It enables multiple robots to track a moving leader while maintaining formation and avoiding obstacles. I developed the core MPC controller and formation logic, ensuring robust coordination in dynamic environments.",
    "mpc_title": "Leader-Follower Formation Control with MPC",
    "mpc_goalTitle": "Project Overview",
    "mpc_goalDesc": "This project implements a centralized leader-follower formation control system using Model Predictive Control (MPC) in MATLAB. The system enables a team of robots to maintain geometric formation, track a moving leader, and avoid obstacles in dynamic environments. I was responsible for developing the core MPC controller and coordination logic. The approach demonstrates strong robustness against disturbances and serves as a scalable foundation for future multi-agent collaboration.",
    "mpc_demoTitle": "Demonstration",
    "mpc_demoDesc": "The video below demonstrates how follower robots maintain coordinated formation using MPC, even when encountering sharp turns and dynamic obstacles.",
    "mpc_imageDesc": "The figures below show the complete motion trajectories of the robot team after executing formation control. Despite dense obstacle layouts, the system maintained stable formation and effective collision avoidance, validating the robustness of the proposed method.",
    "mpc_methodsTitle": "Core Techniques",
    "mpc_method1": "✓ Designed a centralized MPC framework for real-time formation control",
    "mpc_method2": "✓ Encoded formation geometry and tracking objectives into the cost function",
    "mpc_method3": "✓ Integrated collision avoidance using inter-agent and obstacle constraints",
    "mpc_method4": "✓ Verified system stability through simulation in MATLAB under complex scenarios",
    "mpc_back": "← Return to Portfolio",
    
    "portfolio3__title": "State Estimation for the Tripedal Climbing Robot",
    "portfolio3__description": "This project explores state estimation for a tripedal climbing robot. An EKF-based approach fuses IMU and encoder data to estimate body position, velocity, and orientation in real time, enabling stable climbing and control.",
    "parcli_title": "Tripedal Climbing Robot",
    "parcli_goalTitle": "Project Overview",
    "parcli_goalDesc": "This project investigates the state estimation and control of a custom-built tripedal climbing robot designed for vertical surface traversal. An Extended Kalman Filter (EKF) is employed to fuse IMU and encoder data for real-time estimation of position, velocity, and orientation. These estimates support dynamic stability, foot placement planning, and closed-loop motion control.",
    "parcli_demoTitle": "Demonstration",
    "parcli_demoDesc": "The following video demonstrates the robot's behavior in simulation, including trajectory tracking, posture control, and climbing adaptation. This validates the estimation and control pipeline in a dynamic climbing scenario.",
    "parcli_realIntro": "A physical prototype of the tripedal robot was also constructed to evaluate the estimation method on hardware. The image below shows the assembled platform equipped with onboard sensors and actuators used in real-world testing.",
    "parcli_methodsTitle": "Core Techniques",
    "parcli_method1": "✓ Applied an Extended Kalman Filter (EKF) for estimating position, velocity, and orientation in real time",
    "parcli_method2": "✓ Fused IMU and encoder data to improve robustness under dynamic climbing conditions",
    "parcli_method3": "✓ Built customized dynamic and kinematic models for tripedal locomotion",
    "parcli_method4": "✓ Conducted simulation and visualization using MATLAB and PyDrake to validate estimation accuracy",
    "parcli_back": "← Return to Portfolio",

    "portfolio4__title":"Reinforcement Learning Environment for Autonomous Driving Simulation",
    "portfolio4__description":"This project provides a simulation environment for autonomous driving research using reinforcement learning. It enables testing and training of decision-making algorithms in a controlled environment, facilitating the development of intelligent driving policies.",
    "portfolio1__title":"Multi-Robot Navigation System",
    "portfolio1__description":"A ROS-based navigation system designed for multiple TurtleBot3 robots operating in shared indoor environments. It features autonomous path planning, AMCL-based localization, and real-time sensor fusion. The system integrates Dijkstra and DWA planning algorithms and has been validated through both simulation and real-world testing.",
    "multirobot_title": "Multi-Robot Navigation System",
    "multirobot_goalTitle": "Project Overview",
    "multirobot_goalDesc": "This project develops a ROS-based navigation system for multiple TurtleBot3 robots operating in shared indoor environments. It enables real-time collaborative path planning, AMCL-based localization, and multi-sensor fusion, allowing autonomous and collision-free navigation.",
    "multirobot_demoTitle": "Demonstration",
    "multirobot_demoDesc": "The following video demonstrates coordinated navigation of multiple TurtleBot3 robots in a shared indoor environment, including localization, planning, and obstacle avoidance in real time.",
    "multirobot_methodsTitle": "Core Techniques",
    "multirobot_method1": "✓ Centralized task assignment using global occupancy map",
    "multirobot_method2": "✓ Global planning with Dijkstra, local planning with DWA",
    "multirobot_method3": "✓ Real-time localization with AMCL and laser scan matching",
    "multirobot_method4": "✓ Multi-robot coordination using ROS namespaces and tf tree separation",
    "multirobot_back": "← Return to Portfolio",

    "portfolio5__title":"Soil Moisture Estimation via EKF-Based Sensor Fusion",
    "portfolio5__description":"An EKF-based sensor fusion system for MPT AgTech’s platform, developed through international collaboration. It delivers stable, real-time soil moisture estimation despite environmental noise and hardware limitations.",    
    "soilmoisture_title": "Soil Moisture Estimation System",
    "soilmoisture_goalTitle": "Project Overview",
    "soilmoisture_goalDesc": "This project presents a soil moisture sensing system developed for MPT AgTech’s autonomous seeding platform during my internship at Optik Consultancy. I independently designed the EKF-based filtering pipeline for real-time estimation, while working closely with engineers from multiple countries. The system demonstrates not only technical robustness under field conditions, but also the value of cross-cultural collaboration in delivering impactful agricultural solutions.",
    "soilmoisture_demoTitle": "Demonstration",
    "soilmoisture_demoDesc": "The video below showcases our team’s real-time demonstration of the EKF-based moisture estimation system. Engineers from diverse backgrounds collaborated throughout the project, combining expertise to deliver a robust, field-ready solution that was well received by MPT AgTech.",
    "soilmoisture_feedbackIntro": "The image below is a <a href='https://www.linkedin.com/feed/update/urn:li:activity:7295927342361628672/?actorCompanyId=75593246' target='_blank'>LinkedIn post</a> shared by an engineer at <a href='https://mpt.ag/' target='_blank'>MPT AgTech</a>, highlighting the performance and team effort behind this project. It reflects the recognition our solution received after the demonstration, and lists all core contributors, including myself.",
    "soilmoisture_methodsTitle": "Core Techniques",
    "soilmoisture_method1": "✓ Designed and implemented a real-time EKF-based soil moisture estimation pipeline",
    "soilmoisture_method2": "✓ Filtered sensor signals under real-world noise and environmental fluctuations",
    "soilmoisture_method3": "✓ Calibrated and tuned the filter for hardware non-idealities and field deployment",
    "soilmoisture_method4": "✓ Validated and praised by MPT AgTech engineers in live demonstration",
  
    "soilmoisture_back": "← Return to Portfolio",
    "contact__title":"Contact me",
    "contact__subtitle":"Get in touch",
    "tel":"Tel",
    "tel__number":"166********",
    "email":"E-mail",
    "email__address":"caesar1457@gmail.com",
    "location":"Location",
    "location__detail":"HangZhou , China"
}